tutorials/surfaceTracking/interTrackFoam/capillarity3DoneFluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    trackedSurface
    {
        type            fixedValue;
        value           uniform 0;
    }
    sideWalls
    {
        type            fixedFluxPressure;
        rAU             rAU;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        rAU             rAU;
    }
}

// ************************************************************************* //
