tutorials/surfaceTracking/interTrackFoam/capillarity3DoneFluid/0/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       tetPointVectorField;
    object      motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    trackedSurface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sideWalls
    {
        type            slip;
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
